### [DataFrame/Series 정렬] 
- 종류
    * 행/열 인덱스 기준 정렬 => sort_index()
    * 데이터/값 기준 정렬 => sort_valeus()

[1] 모듈 로딩 및 데이터 준비 <hr>

In [15]:
# 모듈 로딩
import pandas as pd
import numpy as np      # 데이터가 없다 => NaN, nan, Na, na 표기용

In [14]:
# 결측치(Missing Value) 표기법
# pd.NA : Not available
# pd.NaT : Not a Time
# pd.nan : Not a Number

print(pd.NA, pd.NaT, np.nan)

<NA> NaT nan

In [17]:
dataDF = pd.DataFrame( [[1, 22, 39, 4, 85],
                        [11,22, 53, 7,55]] ,
                        index=[100, 29],
                        columns=['A','D','E','B','C'])

display(dataDF)

      A   D   E  B   C
100   1  22  39  4  85
29   11  22  53  7  55

In [ ]:
#________________________________________________________
# 행 인덱스 기준으로 정렬 : [기본값] 행방향 오름차순 정렬
#________________________________________________________
dataDF.sort_index()

      A   D   E  B   C
29   11  22  53  7  55
100   1  22  39  4  85

In [21]:
#________________________________________________________
# 행 인덱스 기준으로 정렬 : [기본값] 행방향 내림차순 정렬
#________________________________________________________
dataDF.sort_index(ascending = False)

      A   D   E  B   C
100   1  22  39  4  85
29   11  22  53  7  55

In [ ]:
#________________________________________________________
# 열 인덱스/열 이름 기준으로 정렬 : [변경] 열방향 내림차순 정렬
#________________________________________________________
display(dataDF)

dataDF.sort_index(axis = 'columns',
                  ascending = False)

      A   D   E  B   C
100   1  22  39  4  85
29   11  22  53  7  55

      E   D   C  B   A
100  39  22  85  4   1
29   53  22  55  7  11

In [ ]:
#________________________________________________________
# 열 인덱스/열 이름 기준으로 정렬 : [변경] 열방향 오름차순 정렬
#________________________________________________________
display(dataDF)

dataDF.sort_index(axis = 'columns')

      A   D   E  B   C
100   1  22  39  4  85
29   11  22  53  7  55

      A  B   C   D   E
100   1  4  85  22  39
29   11  7  55  22  53